const CAPTIONS = [
    {
        type: 'CALM',
        captions: [
            "ชิลๆ",
            "สบาย",
            "อิอิ",
            "เยี่ยม"
        ]
    }, 
    {
        type: 'SAD',
        captions: [
            "โอ้ นี่หรือความเศร้า",
            "เศร้านะ",
            "แง",
            "TT",
            "เป็นเศร้า"
        ]
    },
    {
        type: 'SURPRISED',
        captions: [
            "ว้าว ซ่า",
            "วันเดอร์ฟูลมาก",
            "OMG",
            "โอ้มายกอช",
            "เซอร์ไพร์ซ์"
        ]
    },
    {
        type: 'FEAR',
        captions: [
            "ขนลุกซู่",
            "บรึ้ย~",
            "น่ากลัว",
            "ขนหัวลุก"
        ]
    },
    {
        type: 'CONFUSED',
        captions: [
            "งงมาก",
            "อีหยังวะ",
            "อะไร",
            "อะไรเอ่ย",
            "งอง",
            "ห๊ะ",
            "สับสนไปหมด",
            "ฉันปวดหัวมากนะ"
        ]
    },
    {
        type: 'ANGRY',
        captions: [
            "โกรธละนะ",
            "กริ้ว"
        ]
    },
    {
        type: 'DISGUSTED',
        captions: [
            "อี๋",
            "อีลลล",
            "หยี"
        ]
    },
    {
        type: 'HAPPY',
        captions: [
            "เริ่ด",
            "แฮปปี้",
            "เยี่ยมจริงๆ"
        ]
    },
];

const NEUTRAL_WORDS = [
    "เธอมันแน่",
    "Hello, world!",
    "CLOUD IS COMMING",
    "CLOUD IS CALLING",
    "100100101101101",
    "เธอเห็นเมฆก้อนนั้นไหมหละ อ่อนั่นวิชาcloud",
    "Hello the universe",
    "ยังไงเอ่ย",
    "สวัสดีวันส่งงานจ้า",
    "DEADLINE IS COMMING",
    "คุณนิสิต",
    "วันไนท์มิราเคิล",
    "ซีนเริ่ด",
    "นักจะแกง",
    "ตื่นค่ะ",
    "กลั้น",
    "ไม่พูดดีกว่า",
    "อย่ามั่นเกิน",
    "จะแล้วไหม",
    "ด้่ายหรอเนี่ย",
    "เบาได้เบา",
    "เฉียบ",
    "บลูเบอรรี่มาก",
    "ปั่นจัด",
    "ได้ครับจาร",
    "บาย",
    "ช็อตฟีลมาก",
    "ชอบนะคะ อยากได้",
    "เลิกปลอม",
    "ขอโทษนะ แต่เดี๊ยนไม่ผิด",
    "จะบ้าตายรายวัน",
    "น็อต ทู เดย์จ้า",
    "โลกกลม สังคมเหลี่ยม",
    "เกลียด",
    "แผนของพี่คือทำชีงง",
    "๕๕๕๕๕๕",
    "Docker compose up -d",
    "บีบมือแน่น",
    "แลง",
    "เอาเลย",
    "เริ่มเลย",
    "พร้อม",
    "เกียมขิต",
    "จังงาย",
    "มาเรย",
    "สู้ได้",
    "วงการบันเทิงอะนะ",
    "แกแรงเกิน"
];

const ARRAYWORD = CAPTIONS.reduce((accu, curr) => {
    return accu.concat(curr.captions);
}, []);

export { CAPTIONS, ARRAYWORD, NEUTRAL_WORDS };